{
  "Home": {
    "AppName": "Système de conception IRCC"
  },
  "Buttons": {
    "title": {
      "buttons": "[FR] Buttons"
    },
    "sub-titles": {
      "design-guideline": "[FR] Design Guideline",
      "hierarchy": "[FR] Hierarchy",
      "destructive-actions": "[FR] Destructive actions",
      "plain-buttons": "[FR] Plain buttons",
      "types": "[FR] Types",
      "configs": "[FR] Configurations",
      "anatomy": "[FR] Anatomy",
      "background": "[FR] Background",
      "icon": "[FR] Icon",
      "label": "[FR] Label",
      "specs": "[FR] Specs",
      "content-guideline": "[FR] Content guidelines",
      "label-capitalization": "[FR] Label capitalization",
      "task-focused-labels": "[FR] Task-focused labels",
      "usage-figma": "[FR] Usage in Figma",
      "direction-of-use": "[FR] Directions for use",
      "accessibility": "[FR] Accessibility",
      "colour-contrast": "[FR] Colour contrast",
      "keyboard-accessible": "[FR] Keyboard accessible",
      "research": "[FR] Research"
    },
    "content": {
      "buttons-trigger-action": "[FR] Buttons trigger an action or navigate to another page. They have multiple styles and configurations for various needs. They call attention to actions the user should take to progress through a flow.",
      "ui-available-style": "[FR] This UI element is currently available in our styles package only. The component version is coming soon.",
      "type-primary": "[FR] Primary",
      "type-secondary": "[FR] Secondary",
      "type-critical": "[FR] Critical",
      "type-plain": "[FR] Plain",
      "type-primary-desc": "[FR] Primary buttons are used to highlight the most important actions in any experience. Avoid using more than one primary button in a section or screen whenever possible.",
      "type-secondary-desc": "[FR] Secondary buttons are used most often and are used when less visual attention is required on an action. They can also be used alongside a primary action if there are two options to present to the user that require a different hierarchy.",
      "type-critical-desc": "[FR] Critical buttons are used for destructive actions like deleting user-contributed content.",
      "type-plain-desc": "[FR] Plain buttons can be used for actions that require less attention than a primary or secondary button. They are also useful in situations where the UI is more compact. They are not to be used as links. Use the link text styles for those scenarios.",
      "type-primary-alt": "[FR] Primary button",
      "type-secondary-alt": "[FR] Secondary button",
      "type-critical-alt": "[FR] Critical button",
      "type-plain-alt": "[FR] Plain button",
      "type-plain-critical-alt": "[FR] Plain critical button",
      "size": "[FR] Size",
      "size-sm": "[FR] Small",
      "size-lg": "[FR] Large",
      "layout": "[FR] Layout",
      "layout-fluid": "[FR] Fluid",
      "layout-fixed": "[FR] Fixed",
      "icon": "[FR] Icon",
      "icon-none": "[FR] None",
      "icon-leading": "[FR] Leading",
      "icon-trailing": "[FR] Trailing",
      "state": "[FR] State",
      "state-default": "[FR] Default",
      "state-hover": "[FR] Hover",
      "state-active": "[FR] Active",
      "state-disabled": "[FR] Disabled",
      "state-focus": "[FR] Focus",
      "dos-n-donts": "[FR] Do’s and Don’ts",
      "do": "[FR] Do",
      "dont": "[FR] Don't",
      "design-guide-1": "[FR] Create a visual hierarchy by properly utilizing button types. The button types chosen should feel appropriate for the action they are being assigned to.",
      "design-guide-2": "[FR] Use multiple primary buttons in a single page or section. ",
      "design-guide-3": "[FR] Use the critical button or plain critical button for destructive actions.",
      "design-guide-4": "[FR] Use other button types for destructive actions.",
      "design-guide-5": "[FR] Use plain buttons for allowing the user to perform an action or navigate in app.",
      "design-guide-6": "[FR] Use plain buttons to link the user to other pages or websites. Links should be used in this case.",
      "spacing": "[FR] Spacing for button groups",
      "spacing-desc": "[FR] A button group is a set of buttons that have a contextual relationship. To create consistency with how these actions are visually related, consistent spacing rules should be followed. Large button groups should have 16 pixels between buttons and small button groups should have 12 pixels between buttons.",
      "min-max-width": "[FR] Minimum and maximum widths",
      "min-max-width-desc": "[FR] Large buttons have a maximum width of 400 pixels and a minimum width of 64 pixels. Small buttons have a maximum width of 400 pixels and a minimum width of 52 pixels. ",
      "anatomy-background": "[FR] The background fill behind the button label and icon. The corner radius for both large and small button sizes is 4 pixels.",
      "anatomy-icon": "[FR] Icons are used to support the button label content. They are optional and can be either shown or hidden by using the icon configurations.",
      "anatomy-label": "[FR] The label provides context to the user about what action the button will perform.",
      "content-guideline-1": "[FR] Write button labels in sentence case",
      "content-guideline-2": "[FR] Write button labels in title case",
      "content-guideline-3": "[FR] Write button labels to match the action the button will perform",
      "content-guideline-4": "[FR] Write button labels that are static and don't describe an action.",
      "direction-of-use-1": "[FR] From the “Assets” panel, drag in the <strong>“button”</strong> component from the Components library.",
      "direction-of-use-2": "[FR] In the right panel, configure the properties and variants to meet your needs. ",
      "direction-of-use-3": "[FR] Never override colours, radius, padding, text size, etc. This way foundational elements are kept consistent.",
      "direction-of-use-4": "[FR] If an icon is used, designers can <a target=_blank href=https://www.loom.com/share/b0d137f991034f08b504c93278384c2f>change the Font Awesome keyword</a> to update the icon in the button to any Font Awesome icon.",
      "colour-contrast": "[FR] Primary buttons have a colour contrast ratio of 8.88:1 and passes AAA accessibility standards under WCAG 2.1.",
      "keyboard-accessible": "[FR] Buttons are developed using the native HTML button element to ensure interactive elements are keyboard accessible and pass WCAG 2.1 AA conformity.",
      "research": "[FR] Coming soon.",
      "specs-desc": "[FR] The small button with fluid layout has 8 pixels of vertical padding and 16 pixels of horizontal padding inside the button. The icon has a 20 pixel width and height. There is 8 pixels between the icon and label. The label width is dynamic based on number of characters. The large button with fluid layout has 12 pixels of vertical padding and 20 pixels of horizontal padding inside the button. The icon has a 24 pixel width and height. There is 8 pixels between the icon and label. The label width is dynamic based on number of characters. The small button with fixed layout has 8 pixels of vertical padding and fluid horizontal padding based on the fixed width of the button. The icon has a 20 pixel width and height. There is 8 pixels between the icon and label. The label width is dynamic based on number of characters. The large button with fixed layout has 12 pixels of vertical padding and fluid horizontal padding based on the fixed width of the button. The icon has a 24 pixel width and height. There is 8 pixels between the icon and label. The label width is dynamic based on number of characters."
    },
    "alt-text": {
      "button-types-1a": "[FR] A button using the primary button styling. The button has a filled dark blue backing with white text.",
      "button-types-1b": "[FR] A button using the secondary button styling.The button has no fill, a dark blue border and dark blue text.",
      "button-types-1c": "[FR] A button using the critical button styling. The button has a filled red backing with white text.",
      "button-types-1d": "[FR] A button using the plain button styling. The button has no backing or border.",
      "btn-do-1": "[FR] A UI using multiple button types. There is a primary button, a secondary button and a plain button to create visual hierarchy.",
      "btn-do-2": "[FR] A UI using multiple primary buttons which makes it unclear to the user which action is most important.",
      "btn-do-3": "[FR] A modal window with two options – “Cancel” and “Delete”. The delete button uses the red critical styling.",
      "btn-do-4": "[FR] A modal window with two options – “Cancel” and “Delete”. The delete button uses the dark blue primary styling which is incorrect.",
      "btn-do-5": "[FR] A form UI with plain buttons used to navigate between steps in the form.",
      "btn-do-6": "[FR] A help center listed as a resource with a plain button used to link the user out to the help center website.",
      "button-design-spacing": "[FR] Specs displaying the correct spacing between buttons. Spacing is described in the paragraph below.",
      "button-design-width": "[FR] Specs displaying the minimum and maximum widths of the button component. Widths are described in the paragraph below.",
      "anatomy-image-button": "[FR] The parts that makeup the button component. The parts are described in the content below.",
      "button-content-guide-1": "[FR] A button that has the label “Save changes” written in sentence case.",
      "button-content-guide-2": "[FR] A button that has the label “Save changes” written in title case.",
      "button-content-guide-3": "[FR] A button that has the label “View my documents”.",
      "button-content-guide-4": "[FR] A button that has the label “Documents”.",
      "button-spec": "[FR] Specs displaying the padding and layer measurements within the button component. Specs are described in the paragraph below."
    }
  },
  "RightSideNav": {
    "title": {
      "on-this-page" : "[FR] On this Page"
    },
    "sub-titles": {
      "buttons": "[FR] Buttons",
      "interactive-demo": "[FR] Interactive Demo",
      "usage": "[FR] Usage",
      "anatomy": "[FR] Anatomy",
      "specs": "[FR] Specs",
      "content-guidelines": "[FR] Content guidelines",
      "accessibility": "[FR] Accessibility",
      "research": "[FR] Research",
      "related-components": "[FR] Related components"
    }
  },
  "LeftSideNav": {
    "title": {
      "getting-started" : "[FR] Getting Started",
      "foundation" : "[FR] Foundation",
      "components" : "[FR] Components"
    },
    "sub-titles": {
      "overview": "[FR] Overview",
      "for-developers": "[FR] For developers",
      "for-designers": "[FR] For designers",
      "accessibility": "[FR] Accessibility",
      "colours": "[FR] Colours",
      "typography": "[FR] Typography",
      "iconography": "[FR] Iconography",
      "layouts": "[FR] Layouts",
      "tokens": "[FR] Tokens",
      "buttons": "[FR] Buttons",
      "checkbox": "[FR] Checkbox",
      "external-link": "[FR] External Link",
      "footer": "[FR] Footer",
      "header": "[FR] Header",
      "icon-button": "[FR] Icon button",
      "input-field": "[FR] Input field",
      "radio-button": "[FR] Radio button",
      "tabs": "[FR] Tabs"
    }
  },
  "TitleSlugUrl": {
    "copy-url": "Copier le lien"
  }
}
