{
  "Home": {
    "AppName": "Système de conception IRCC"
  },
  "Buttons": {
    "title": {
      "buttons": "[FR] Buttons"
    },
    "sub-titles": {
      "design-guideline": "[FR] Design Guideline",
      "hierarchy": "[FR] Hierarchy",
      "destructive-actions": "[FR] Destructive actions",
      "plain-buttons": "[FR] Plain buttons",
      "types": "[FR] Types",
      "configs": "[FR] Configurations",
      "anatomy": "[FR] Anatomy",
      "background": "[FR] Background",
      "icon": "[FR] Icon",
      "label": "[FR] Label",
      "specs": "[FR] Specs",
      "content-guideline": "[FR] Content guidelines",
      "label-capitalization": "[FR] Label capitalization",
      "task-focused-labels": "[FR] Task-focused labels",
      "usage-figma": "[FR] Usage in Figma",
      "direction-of-use": "[FR] Directions for use",
      "accessibility": "[FR] Accessibility",
      "colour-contrast": "[FR] Colour contrast",
      "keyboard-accessible": "[FR] Keyboard accessible",
      "research": "[FR] Research"
    },
    "content": {
      "buttons-trigger-action": "[FR] Buttons trigger an action or navigate to another page. They have multiple styles and configurations for various needs. They call attention to actions the user should take to progress through a flow.",
      "ui-available-style": "[FR] This UI element is currently available in our styles package only. The component version is coming soon.",
      "type-primary": "[FR] Primary",
      "type-secondary": "[FR] Secondary",
      "type-critical": "[FR] Critical",
      "type-plain": "[FR] Plain",
      "type-primary-desc": "[FR] Primary buttons are used to highlight the most important actions in any experience. Avoid using more than one primary button in a section or screen whenever possible.",
      "type-secondary-desc": "[FR] Secondary buttons are used most often and are used when less visual attention is required on an action. They can also be used alongside a primary action if there are two options to present to the user that require a different hierarchy.",
      "type-critical-desc": "[FR] Critical buttons are used for destructive actions like deleting user-contributed content.",
      "type-plain-desc": "[FR] Plain buttons can be used for actions that require less attention than a primary or secondary button. They are also useful in situations where the UI is more compact. They are not to be used as links. Use the link text styles for those scenarios.",
      "type-primary-alt": "[FR] Primary button",
      "type-secondary-alt": "[FR] Secondary button",
      "type-critical-alt": "[FR] Critical button",
      "type-plain-alt": "[FR] Plain button",
      "type-plain-critical-alt": "[FR] Plain critical button",
      "size": "[FR] Size",
      "size-sm": "[FR] Small",
      "size-lg": "[FR] Large",
      "layout": "[FR] Layout",
      "layout-fluid": "[FR] Fluid",
      "layout-fixed": "[FR] Fixed",
      "icon": "[FR] Icon",
      "icon-none": "[FR] None",
      "icon-leading": "[FR] Leading",
      "icon-trailing": "[FR] Trailing",
      "state": "[FR] State",
      "state-default": "[FR] Default",
      "state-hover": "[FR] Hover",
      "state-active": "[FR] Active",
      "state-disabled": "[FR] Disabled",
      "state-focus": "[FR] Focus",
      "dos-n-donts": "[FR] Do’s and Don’ts",
      "do": "[FR] Do",
      "dont": "[FR] Don't",
      "design-guide-1": "[FR] Create a visual hierarchy by properly utilizing button types. The button types chosen should feel appropriate for the action they are being assigned to.",
      "design-guide-2": "[FR] Use multiple primary buttons in a single page or section. ",
      "design-guide-3": "[FR] Use the critical button or plain critical button for destructive actions.",
      "design-guide-4": "[FR] Use other button types for destructive actions.",
      "design-guide-5": "[FR] Use plain buttons for allowing the user to perform an action or navigate in app.",
      "design-guide-6": "[FR] Use plain buttons to link the user to other pages or websites. Links should be used in this case.",
      "spacing": "[FR] Spacing for button groups",
      "spacing-desc": "[FR] A button group is a set of buttons that have a contextual relationship. To create consistency with how these actions are visually related, consistent spacing rules should be followed. Large button groups should have 16 pixels between buttons and small button groups should have 12 pixels between buttons.",
      "min-max-width": "[FR] Minimum and maximum widths",
      "min-max-width-desc": "[FR] Large buttons have a maximum width of 400 pixels and a minimum width of 64 pixels. Small buttons have a maximum width of 400 pixels and a minimum width of 52 pixels. ",
      "anatomy-background": "[FR] The background fill behind the button label and icon. The corner radius for both large and small button sizes is 4 pixels.",
      "anatomy-icon": "[FR] Icons are used to support the button label content. They are optional and can be either shown or hidden by using the icon configurations.",
      "anatomy-label": "[FR] The label provides context to the user about what action the button will perform.",
      "content-guideline-1": "[FR] Write button labels in sentence case",
      "content-guideline-2": "[FR] Write button labels in title case",
      "content-guideline-3": "[FR] Write button labels to match the action the button will perform",
      "content-guideline-4": "[FR] Write button labels that are static and don't describe an action.",
      "direction-of-use-1": "[FR] From the “Assets” panel, drag in the <strong>“button”</strong> component from the Components library.",
      "direction-of-use-2": "[FR] In the right panel, configure the properties and variants to meet your needs. ",
      "direction-of-use-3": "[FR] Never override colours, radius, padding, text size, etc. This way foundational elements are kept consistent.",
      "direction-of-use-4": "[FR] If an icon is used, designers can <a target=_blank href=https://www.loom.com/share/b0d137f991034f08b504c93278384c2f>change the Font Awesome keyword</a> to update the icon in the button to any Font Awesome icon.",
      "colour-contrast": "[FR] Primary buttons have a colour contrast ratio of 8.88:1 and passes AAA accessibility standards under WCAG 2.1.",
      "keyboard-accessible": "[FR] Buttons are developed using the native HTML button element to ensure interactive elements are keyboard accessible and pass WCAG 2.1 AA conformity.",
      "research": "[FR] Coming soon.",
      "specs-desc": "[FR] The small button with fluid layout has 8 pixels of vertical padding and 16 pixels of horizontal padding inside the button. The icon has a 20 pixel width and height. There is 8 pixels between the icon and label. The label width is dynamic based on number of characters. The large button with fluid layout has 12 pixels of vertical padding and 20 pixels of horizontal padding inside the button. The icon has a 24 pixel width and height. There is 8 pixels between the icon and label. The label width is dynamic based on number of characters. The small button with fixed layout has 8 pixels of vertical padding and fluid horizontal padding based on the fixed width of the button. The icon has a 20 pixel width and height. There is 8 pixels between the icon and label. The label width is dynamic based on number of characters. The large button with fixed layout has 12 pixels of vertical padding and fluid horizontal padding based on the fixed width of the button. The icon has a 24 pixel width and height. There is 8 pixels between the icon and label. The label width is dynamic based on number of characters."
    },
    "alt-text": {
      "button-types-1a": "[FR] A button using the primary button styling. The button has a filled dark blue backing with white text.",
      "button-types-1b": "[FR] A button using the secondary button styling.The button has no fill, a dark blue border and dark blue text.",
      "button-types-1c": "[FR] A button using the critical button styling. The button has a filled red backing with white text.",
      "button-types-1d": "[FR] A button using the plain button styling. The button has no backing or border.",
      "btn-do-1": "[FR] A UI using multiple button types. There is a primary button, a secondary button and a plain button to create visual hierarchy.",
      "btn-do-2": "[FR] A UI using multiple primary buttons which makes it unclear to the user which action is most important.",
      "btn-do-3": "[FR] A modal window with two options – “Cancel” and “Delete”. The delete button uses the red critical styling.",
      "btn-do-4": "[FR] A modal window with two options – “Cancel” and “Delete”. The delete button uses the dark blue primary styling which is incorrect.",
      "btn-do-5": "[FR] A form UI with plain buttons used to navigate between steps in the form.",
      "btn-do-6": "[FR] A help center listed as a resource with a plain button used to link the user out to the help center website.",
      "button-design-spacing": "[FR] Specs displaying the correct spacing between buttons. Spacing is described in the paragraph below.",
      "button-design-width": "[FR] Specs displaying the minimum and maximum widths of the button component. Widths are described in the paragraph below.",
      "anatomy-image-button": "[FR] The parts that makeup the button component. The parts are described in the content below.",
      "button-content-guide-1": "[FR] A button that has the label “Save changes” written in sentence case.",
      "button-content-guide-2": "[FR] A button that has the label “Save changes” written in title case.",
      "button-content-guide-3": "[FR] A button that has the label “View my documents”.",
      "button-content-guide-4": "[FR] A button that has the label “Documents”.",
      "button-spec": "[FR] Specs displaying the padding and layer measurements within the button component. Specs are described in the paragraph below."
    }
  },
  "Utilities": {
    "title": {
      "tokens": "[FR] Tokens",
      "utilities": "[FR] Utilities"
    },
    "sub-titles": {
      "width": "[FR] Width",
      "pixels": "[FR] pixels"
    },
    "content": {
      "token-desc": "[FR] Utilities are re-usable tokens, variables, etc. that are applied consistently to elements and components throughout the entire design system. This creates consistency in how the design system’s foundations are applied and allows efficient and reliable design iterations to be made globally.",
      "figma-usage": "[FR] Use {{px}} pixels of spacing",
      "bp-figma-usage": "[FR] Set frame width to {{px}} pixels"
    },
    "alt-text": {
    },
    "TypographyHeading": "[FR] Typography",
    "TypographyText": "[FR] The type scale keeps the number of styles to a minimum and is designed to ensure an affective visual hierarchy of content globally. Text styles include point sizes, line heights and paragraph spacing that pass AAA accessibility standards under WCAG 2.1.",
    "SpacingText": "[FR] Spacing units to apply as padding or margins throughout the UI. Spacing options are limited to help create consistency across spacing decisions. All spacing units are a multiple of four to adhere to a four pixel grid.",
    "SpacingTableSampleHeading": "[FR] Sample",
    "SpacingTableVariableHeading": "[FR] Variable name",
    "SpacingTableValueHeading": "[FR] Value",
    "SpacingTableFigmaHeading": "[FR] Figma usage",
    "BreakpointsHeading": "[FR] Breakpoints",
    "BreakpointsText": "[FR] Setting breakpoints allows content and design to adapt in order to provide the best possible layout for the viewport or device. Use these common breakpoint widths for layout consistency. Design system consumers can add additional breakpoints as needed.",
    "ColourText": "[FR] Designers have a variety of colours to choose from to ensure clear communication, indicate UI functionality, and provide colour contrast that complies with accessibility standards. The colour system is designed to define meaning for each colour, allow for global colour changes, and ensure every colour used comes from the system.",
    "SpacingHeading": "[FR] Spacing",
    "ColourTableTokenHeading": "[FR] Token name",
    "ColourTableColourHeading": "[FR] Colour role, hue & hex value",
    "ColourTableFigmaHeading": "[FR] Figma colour style",
    "ColourTableDescriptionHeading": "[FR] Description",
    "ColourTableDescriptionRow1": "[FR] Background of the primary button.",
    "ColourTableDescriptionRow2": "[FR] Background of the primary button while in the hover state.",
    "ColourTableDescriptionRow3": "[FR] Background of the primary button while in the active state.",
    "ColourTableDescriptionRow4": "[FR] Background of the primary button while in the disabled state.",
    "ColourTableDescriptionRow5": "[FR] Text and icon within the primary button.",
    "ColourTableDescriptionRow6": "[FR] Text and icon within the disabled state of the primary button.",
    "ColourTableDescriptionRow7": "[FR] Background of the primary button using the Critical colour role.",
    "ColourTableDescriptionRow8": "[FR] Background of the primary button using the Critical colour role while in the hover state.",
    "ColourTableDescriptionRow9": "[FR] Background of the primary button using the Critical colour role while in the active state.",
    "ColourTableDescriptionRow10": "[FR] Background of the primary button using the Critical colour role while in the disabled state.",
    "ColourTableDescriptionRow11": "[FR] Text and icon within the primary button using the Critical colour role.",
    "ColourTableDescriptionRow12": "[FR] Text and icon within the disabled state of the primary button using the Critical colour role.",
    "ColourTableDescriptionRow13": "[FR] Border of the secondary button.",
    "ColourTableDescriptionRow14": "[FR] Border of the secondary button while in the hover state.",
    "ColourTableDescriptionRow15": "[FR] Border of the secondary button while in the active state.",
    "ColourTableDescriptionRow16": "[FR] Border of the secondary button while in the disabled state.",
    "ColourTableDescriptionRow17": "[FR] Text and icon within the secondary button.",
    "ColourTableDescriptionRow18": "[FR] Text and icon within the disabled state of the secondary button.",
    "ColourTableDescriptionRow19": "[FR] Border of the secondary button using the Critical colour role.",
    "ColourTableDescriptionRow20": "[FR] Border of the secondary button using the Critical colour role while in the hover state.",
    "ColourTableDescriptionRow21": "[FR] Border of the secondary button using the Critical colour role while in the active state.",
    "ColourTableDescriptionRow22": "[FR] Border of the secondary button using the Critical colour role while in the disabled state.",
    "ColourTableDescriptionRow23": "[FR] Text and icon within the secondary button using the Critical colour role.",
    "ColourTableDescriptionRow24": "[FR] Text and icon within the disabled state of the secondary button using the Critical colour role.",
    "ColourTableDescriptionRow25": "[FR] Text colour of links in the default state.",
    "ColourTableDescriptionRow26": "[FR] Text colour of links in the hover state.",
    "ColourTableDescriptionRow27": "[FR] Text colour of links in the active state.",
    "ColourTableDescriptionRow28": "[FR] Text colour of links after they have been visited.",
    "ColourTableDescriptionRow29": "[FR] Background of alert banners with the warning sentiment.",
    "ColourTableDescriptionRow30": "[FR] Border of alert banners with the warning sentiment.",
    "ColourTableDescriptionRow31": "[FR] Icon in alert banners with the warning sentiment.",
    "ColourTableDescriptionRow32": "[FR] Background of alert banners with the critical sentiment.",
    "ColourTableDescriptionRow33": "[FR] Border of alert banners with the critical sentiment.",
    "ColourTableDescriptionRow34": "[FR] Icon in alert banners with the critical sentiment.",
    "ColourTableDescriptionRow35": "[FR] Background of alert banners with the success sentiment.",
    "ColourTableDescriptionRow36": "[FR] Border of alert banners with the success sentiment.",
    "ColourTableDescriptionRow37": "[FR] Icon in alert banners with the success sentiment.",
    "ColourTableDescriptionRow38": "[FR] Background of alert banners with the information sentiment.",
    "ColourTableDescriptionRow39": "[FR] Border of alert banners with the information sentiment.",
    "ColourTableDescriptionRow40": "[FR] Icon in alert banners with the information sentiment.",
    "ColourTableDescriptionRow41": "[FR] Background of selected form elements while displaying an error.",
    "ColourTableDescriptionRow42": "[FR] Background of selected form elements while displaying an error and in the hover state.",
    "ColourTableDescriptionRow43": "[FR] Background of selected form elements while displaying an error and in the active state.",
    "ColourTableDescriptionRow44": "[FR] Background of selected form elements while displaying an error and in the disabled state.",
    "ColourTableDescriptionRow45": "[FR] Background of unselected form elements while displaying an error.",
    "ColourTableDescriptionRow46": "[FR] Background of unselected form elements while displaying an error and in the hover state.",
    "ColourTableDescriptionRow47": "[FR] Background of unselected form elements while displaying an error and in the active state.",
    "ColourTableDescriptionRow48": "[FR] Background of unselected form elements while displaying an error and in the disabled state.",
    "ColourTableDescriptionRow49": "[FR] Border of unselected form elements while displaying an error.",
    "ColourTableDescriptionRow50": "[FR] Border of unselected form elements while displaying an error and in a hover state.",
    "ColourTableDescriptionRow51": "[FR] Border of unselected form elements while displaying an error and in a disabled state.",
    "ColourTableDescriptionRow52": "[FR] Text used for error messages.",
    "ColourTableDescriptionRow53": "[FR] Background of selected form elements while displaying success.",
    "ColourTableDescriptionRow54": "[FR] Background of selected form elements while displaying success and in the hover state.",
    "ColourTableDescriptionRow55": "[FR] Background of selected form elements while displaying success and in the active state.",
    "ColourTableDescriptionRow56": "[FR] Background of selected form elements while displaying success and in the disabled state.",
    "ColourTableDescriptionRow57": "[FR] Background of unselected form elements while displaying success.",
    "ColourTableDescriptionRow58": "[FR] Background of unselected form elements while displaying success and in the hover state.",
    "ColourTableDescriptionRow59": "[FR] Background of unselected form elements while displaying success and in the active state.",
    "ColourTableDescriptionRow60": "[FR] Background of unselected form elements while displaying success and in the disabled state.",
    "ColourTableDescriptionRow61": "[FR] Border of unselected form elements while displaying success.",
    "ColourTableDescriptionRow62": "[FR] Border of unselected form elements while displaying success and in a hover state.",
    "ColourTableDescriptionRow63": "[FR] Border of unselected form elements while displaying success and in a disabled state.",
    "ColourTableDescriptionRow64": "[FR] Text used for success messages.",
    "ColourTableDescriptionRow65": "[FR] Background of selected form elements while displaying warning.",
    "ColourTableDescriptionRow66": "[FR] Background of selected form elements while displaying warning and in the hover state.",
    "ColourTableDescriptionRow67": "[FR] Background of selected form elements while displaying warning and in the active state.",
    "ColourTableDescriptionRow68": "[FR] Background of selected form elements while displaying warning and in the disabled state.",
    "ColourTableDescriptionRow69": "[FR] Background of unselected form elements while displaying warning.",
    "ColourTableDescriptionRow70": "[FR] Background of unselected form elements while displaying warning and in the hover state.",
    "ColourTableDescriptionRow71": "[FR] Background of unselected form elements while displaying warning and in the active state.",
    "ColourTableDescriptionRow72": "[FR] Background of unselected form elements while displaying warning and in the disabled state.",
    "ColourTableDescriptionRow73": "[FR] Border of unselected form elements while displaying warning.",
    "ColourTableDescriptionRow74": "[FR] Border of unselected form elements while displaying warning and in a hover state.",
    "ColourTableDescriptionRow75": "[FR] Border of unselected form elements while displaying warning and in a disabled state.",
    "ColourTableDescriptionRow76": "[FR] Text used for warning messages.",
    "ColourTableDescriptionRow77": "[FR] Background of selected form elements while displaying information.",
    "ColourTableDescriptionRow78": "[FR] Background of selected form elements while displaying information and in the hover state.",
    "ColourTableDescriptionRow79": "[FR] Background of selected form elements while displaying information and in the active state.",
    "ColourTableDescriptionRow80": "[FR] Background of selected form elements while displaying information and in the disabled state.",
    "ColourTableDescriptionRow81": "[FR] Background of unselected form elements while displaying information.",
    "ColourTableDescriptionRow82": "[FR] Background of unselected form elements while displaying information and in the hover state.",
    "ColourTableDescriptionRow83": "[FR] Background of unselected form elements while displaying information and in the active state.",
    "ColourTableDescriptionRow84": "[FR] Background of unselected form elements while displaying information and in the disabled state.",
    "ColourTableDescriptionRow85": "[FR] Border of unselected form elements while displaying information.",
    "ColourTableDescriptionRow86": "[FR] Border of unselected form elements while displaying information and in a hover state.",
    "ColourTableDescriptionRow87": "[FR] Border of unselected form elements while displaying information and in a disabled state.",
    "ColourTableDescriptionRow88": "[FR] Text used for information messages.",
    "ColourTableDescriptionRow89": "[FR] Main background of the page.",
    "ColourTableDescriptionRow90": "[FR] Can be used for side panels, mastheads, footers if using a different colour than the main bg is desired.",
    "ColourTableDescriptionRow91": "[FR] Used for surfaces that temporarily overlay on the main product – flyout menus, modal windows, dropdown menus, etc.",
    "ColourTableDescriptionRow92": "[FR] Background fill on interactive elements that have no fill when in the hover state.",
    "ColourTableDescriptionRow93": "[FR] Background fill on interactive elements that have no fill when in the active state.",
    "ColourTableDescriptionRow94": "[FR] Generic, accessible border outline. Can be used to outline input fields, tables, etc.",
    "ColourTableDescriptionRow95": "[FR] Generic, accessible border outline in the hover state. Can be used to outline input fields, etc.",
    "ColourTableDescriptionRow96": "[FR] Generic, accessible border outline in the disabled state. Can be used to outline input fields, etc.",
    "ColourTableDescriptionRow97": "[FR] Used for divider lines to separate content, page architecture, table cells, etc.",
    "ColourTableDescriptionRow98": "[FR] Transparent background used to create separation between a screen and a popup or modal window.",
    "ColourTableDescriptionRow99": "[FR] Used for selected indicators on navigation items.",
    "ColourTableDescriptionRow100": "[FR] Used for selected indicators on navigation items that are in a hover state.",
    "ColourTableDescriptionRow101": "[FR] Used for selected backgrounds on navigation items.",
    "ColourTableDescriptionRow102": "[FR] Used for selected backgrounds on navigation items that are in a hover state.",
    "ColourTableDescriptionRow103": "[FR] Used to indicate selected form controls.",
    "ColourTableDescriptionRow104": "[FR] Used to indicate selected form controls that are in a hover state.",
    "ColourTableDescriptionRow105": "[FR] Used for selected indicators on navigation items that are in a disabled state.",
    "ColourTableDescriptionRow106": "[FR] Used to indicate selected form controls that are in a disabled state.",
    "ColourTableDescriptionRow107": "[FR] Text and selected indicators on top of components that are in a selected state. For example, the checkmark icon within of a selected checkbox.",
    "ColourTableDescriptionRow108": "[FR] All text that requires a primary visual hierarchy.",
    "ColourTableDescriptionRow109": "[FR] All text that requires a secondary visual hierarchy. Can also be used as supporting text alongside primary text if there is a contextual relationship between the two.",
    "ColourTableDescriptionRow110": "[FR] Placeholder text within input field components.",
    "ColourTableDescriptionRow111": "[FR] Disabled text within interactive elements that use a neutral text palette.",
    "ColourTableDescriptionRow112": "[FR] The outline used to indicate that an element is in focus.",
    "TypographyTableStyleHeading": "[FR] Style",
    "TypographyTableFontWeightHeading": "[FR] Font & weight",
    "TypographyTableSizeHeading": "[FR] Size",
    "TypographyTableLineHeightHeading": "[FR] Line height & paragraph spacing",
    "TypographyTableFigmaHeading": "[FR] Figma text style",
    "TypographyTableTokenHeading": "[FR] Tag name"
  },
  "RightSideNav": {
    "title": {
      "on-this-page" : "[FR] On this Page"
    },
    "sub-titles": {
      "buttons": "[FR] Buttons",
      "interactive-demo": "[FR] Interactive Demo",
      "usage": "[FR] Usage",
      "anatomy": "[FR] Anatomy",
      "specs": "[FR] Specs",
      "content-guidelines": "[FR] Content guidelines",
      "accessibility": "[FR] Accessibility",
      "research": "[FR] Research",
      "related-components": "[FR] Related components"
    }
  },
  "LeftSideNav": {
    "title": {
      "getting-started" : "[FR] Getting Started",
      "foundation" : "[FR] Foundation",
      "components" : "[FR] Components"
    },
    "sub-titles": {
      "overview": "[FR] Overview",
      "for-developers": "[FR] For developers",
      "for-designers": "[FR] For designers",
      "accessibility": "[FR] Accessibility",
      "colours": "[FR] Colours",
      "typography": "[FR] Typography",
      "iconography": "[FR] Iconography",
      "layouts": "[FR] Layouts",
      "tokens": "[FR] Tokens",
      "utilities": "[FR] Utilities",
      "buttons": "[FR] Buttons",
      "checkbox": "[FR] Checkbox",
      "external-link": "[FR] External Link",
      "footer": "[FR] Footer",
      "header": "[FR] Header",
      "icon-button": "[FR] Icon button",
      "input-field": "[FR] Input field",
      "radio-button": "[FR] Radio button",
      "tabs": "[FR] Tabs"
    }
  },
  "TitleSlugUrl": {
    "copy-url": "Copier le lien"
  },
  "OverviewPage": {
    "title": "[FR] Overview",
    "sub-title": "[FR] IRCC design system",
    "sub-title-description": "[FR] The IRCC design system is a toolkit of shared design and code that provides visual language, components, patterns and guidelines – all in one centralized source of truth that enables product teams to build scalable, accessible, unified experiences. It is customized for the client and officer experience and allows teams to efficiently build consistent immigration digital services.",
    "sub-heading-1": "[FR] For designers",
    "sub-heading-1-description": "[FR] Learn how to get started with the IRCC design system Figma library.",
    "sub-heading-2": "[FR] For developers",
    "sub-heading-2-description": "[FR] Learn how to get started with lorem ipsum dolor sir amet consecteteur.",
    "get-started-sub-text": "[FR] Get started"
  },
  "Designers": {
    "Heading": "[FR] For designers",
    "HeadingText": "[FR] If you’re a designer, start here to find everything you need to use the design system’s Figma library.",
    "AboutHeading": "[FR] About the design library",
    "AboutText1": "[FR] The design system consists, in part, of a Figma library. This is the primary tool for designers to use and it allows them to create system-compatible designs. The design library is a centralized set of Figma files that is maintained by a core design system team. By connecting your project to the design library, your projects will automatically inherit updates, improvements and new features published to the design library.",
    "AboutText2": "[FR] Figma is a collaborative design platform that is built to handle UI/UX and design system use cases. <a href='https://www.figma.com'>Learn more about Figma</a> or browse <a href='https://www.youtube.com/@Figma'>Figma’s Youtube channel</a> to become more familiar with the software or watch tutorials.",
    "AccessHeading": "[FR] Requesting access to the design library",
    "AccessText1": "[FR] The design library is published as a team library on Figma. There are currently three Figma files to connect to your project in order to access the full design system – Foundations, Components and Patterns. Here are the steps to get access:",
    "AccessListItem1": "[FR] <a href='https://www.figma.com/signup'>Create a Figma account</a> if you don’t have one already.",
    "AccessListItem2": "[FR] Email Matthew.Emond@cic.gc.ca and tell us the email you use for your Figma account. You will receive a response as soon as we’ve granted you access.",
    "AccessListItem3": "[FR] Once you have received confirmation that you have access, log into Figma with the email you provided.",
    "AccessListItem4": "[FR] Create a new design file or open an existing project.",
    "AccessListItem5": "[FR] On the left sidebar, select “Assets,” then select the Team Library icon.",
    "AccessListItem6": "[FR] Enable the team library by selecting the toggle next to the <strong>“Foundations”</strong>, <strong>“Components”</strong> and <strong>“Patterns”</strong> libraries.",
    "AccessText2": "[FR] You should now have access to the colours & text styles, components, and user patterns.",
    "AccessText3": "[FR] Once you have enabled the team libraries, you will automatically receive any updates or additions to styles and components that are published in the future.",
    "FigmaImg1AltText": "[FR] The Figma interface used for connecting external component libraries to a Figma file.",
    "InstallFontsHeading": "[FR] Installing the design system fonts",
    "InstallFontsText1": "[FR] The design system uses Lato, Inter and Font Awesome (icon font). Lato and Inter are Google fonts and should automatically be available within Figma in the font picker. Font Awesome has been set as a “shared font” for our organization plan and should also be available automatically within Figma in the font picker. If you are not a member of the “IRCC - Journey Labs” Figma organization, you will need to obtain and install a paid version of Font Awesome or use your own icon font in combination with this design system.",
    "InstallFontsLink": "[FR] <a href=https://fontawesome.com/'>Learn more about Font Awesome </a>",
    "InstallFontsLinkURL": "[FR] https://fontawesome.com/",
    "UsingStylesHeading": "[FR] Using design system styles",
    "UsingStylesText1": "[FR] Once you’ve connected to the Figma libraries, and ensured you have access to the correct fonts within Figma, you’re ready to start using the colour and text styles from the system.",
    "UsingStylesStrokeText1": "[FR] To apply a fill or stroke colour:",
    "UsingStylesStrokeListItem1": "[FR] Make sure you’ve connected the <strong>“Foundations”</strong> library to your Figma file",
    "UsingStylesStrokeListItem2": "[FR] Select the layer you want to apply the colour style to",
    "UsingStylesStrokeListItem3": "[FR] In the design panel, click on the style icon (four dots) and find the system colour style you want to apply under the “fill” and/or “stroke” properties",
    "UsingStylesStrokeListItem4": "[FR] Pro tip: Use the search field to filter the colour style list",
    "UsingStylesStrokeText2": "[FR] See the <a href='#'>list of all colour tokens</a> and how they apply. We will be adding a colours page to this documentation site for additional details and guidance.",
    "UsingStylesStrokeImgAltText": "[FR] The Figma interface used for applying colour styles to a layer.",
    "UsingStylesTextText1": "[FR] To apply a text style:",
    "UsingStylesTextListItem1": "[FR] Make sure you’ve connected the <strong>“Foundations”</strong> library to your Figma file",
    "UsingStylesTextListItem2": "[FR] Select the text layer you want to the text style to",
    "UsingStylesTextListItem3": "[FR] In the design panel, click on the style icon (four dots) and find the system text style you want to apply under the “text” property",
    "UsingStylesTextListItem4": "[FR] Pro tip: Use the search field to filter the text style list",
    "UsingStylesTextText2": "[FR] See the <a href='#'>list of all text tokens</a> and how they apply. We will be adding a typography page to this documentation site for additional details and guidance.",
    "UsingStylesTextImgAltText": "[FR] The Figma interface used for applying text styles to a text layer.",
    "UsingComponentsHeading": "[FR] Using design system components",
    "UsingComponentsText1": "[FR] Once you’ve connected to the Figma libraries, and ensured you have access to the correct fonts within Figma, you’re ready to start using the components from the system.",
    "UsingComponentsInsertText1": "[FR] To insert a system component into your design file:",
    "UsingComponentsInsertListItem1": "[FR] Make sure you’ve connected the <strong>“Components”</strong> and <strong>“Patterns”</strong> libraries to your Figma file",
    "UsingComponentsInsertListItem2": "[FR] In the left side panel, click on the “Assets” tab",
    "UsingComponentsInsertListItem3": "[FR] Find the component you would like to insert into your design by either searching or browsing the component list",
    "UsingComponentsInsertListItem4": "[FR] Drag and drop the component from the side panel into your design",
    "UsingComponentsInsertListItem5": "[FR] Pro tip: Use the search field to filter the component list",
    "UsingComponentsInsertImgAlt": "[FR] The Figma assets panel used for viewing external and local components.",
    "UsingComponentsConfigureText1": "[FR] Most components have configurable options. To configure the component you inserted:",
    "UsingComponentsConfigureListItem1": "[FR] Select the component you would like to configure",
    "UsingComponentsConfigureListItem2": "[FR] Find the available options in the design panel",
    "UsingComponentsConfigureListItem3": "[FR] Use the dropdown menus and toggles to select the desired configuration",
    "UsingComponentsConfigureImgAlt": "[FR] The Figma design panel displaying configuration options for a button component.",
    "FigmaHeading": "[FR] Figma usage guidelines",
    "FigmaText": "[FR] The above is general information in order to get started. You can find more detailed Figma usage guidelines specific to each system part on on their respective pages throughout this site."
  }
}



