{
  "Home": {
    "AppName": "Système de conception IRCC",
    "DateModified": "Date de modification"
  },
  "ROUTES": {
    "overview": "aperçu",
    "forDesigners": "pour-les-designers",
    "forDevelopers": "pour-les-développeurs",
    "utilities": "utilitaires",
    "buttons": "boutons",
    "contact": "contactez"
  },
  "Buttons": {
    "Title": "Boutons",
    "CopyURL": "Copier l’URL",
    "Intro": "Les boutons déclenchent une action ou permettent de naviguer vers une autre page. Ils ont de multiples styles et configurations selon les besoins variés. Ils attirent l’attention sur les actions que l’utilisateur doit effectuer pour progresser dans un flux.",
    "IntroAlert": "Cet élément de l’interface utilisateur est actuellement disponible uniquement dans le prologiciel des styles. Il sera bientôt offert pour le progiciel des composantes.",
    "TypesHeading": "Types",
    "PrimaryHeading": "Principal",
    "PrimaryBtnText": "Bouton principal",
    "PrimaryText": "Les boutons principaux sont utilisés pour mettre en évidence les actions les plus importantes dans toute expérience utilisateur. Éviter autant que possible d’utiliser plus d’un bouton principal dans la même section ou le même écran.",
    "SecondaryHeading": "Secondaire",
    "SecondaryIBtnText": "Bouton secondaire",
    "SecondaryText": "Les boutons secondaires sont les plus utilisés et ils sont utilisés lorsqu’une action requiert moins d’attention visuelle. Ils peuvent également être utilisés parallèlement à une action principale s’il y a deux options à présenter à l’utilisateur et que ces options nécessitent une hiérarchie différente.",
    "CriticalHeading": "Critique",
    "CriticalBtnText": "Bouton critique",
    "CriticalText": "Les boutons critiques sont utilisés pour des actions de destruction comme la suppression du contenu fourni par l’utilisateur.",
    "PlainHeading": "Simple",
    "PlainBtnText": "Bouton simple",
    "PlainBtnTexts": "Boutons simples",
    "PlainText": "Les boutons simples peuvent être utilisés pour des actions qui nécessitent moins d’attention que celles des boutons principaux ou secondaires. Ils sont également utiles dans les situations où l’interface utilisateur est plus compacte. Ces boutons ne doivent pas être utilisés comme des liens. Utiliser les styles de texte des liens dans ces situations.",
    "PlainCritBtnText": "Bouton simple critique",
    "ConfigurationsHeading": "Configurations",
    "ConfigSizeHeading": "Format",
    "ConfigSizeSmall": "Small",
    "ConfigSizeLarge": "Large",
    "ConfigLayoutHeading": "Disposition",
    "ConfigLayoutFluid": "Fluid",
    "ConfigLayoutFixed": "Fixed",
    "ConfigIconHeading": "Icône",
    "ConfigIconNone": "None",
    "ConfigIconLeading": "Leading",
    "ConfigIconTrailing": "Trailing",
    "ConfigStateHeading": "État",
    "ConfigStateDefault": "Default",
    "ConfigStateHover": "Hover",
    "ConfigStateActive": "Active",
    "ConfigStateDisabled": "Disabled",
    "ConfigStateFocus": "Focus",
    "DoHeading": "À faire",
    "DontHeading": "À ne pas faire",
    "DesignGuidelinesHeading": "Lignes directrices de la conception",
    "HierarchyHeading": "Hiérarchie",
    "HierarchyDoText": "Il est possible de créer une hiérarchie visuelle en utilisant correctement les types de boutons. Les types de boutons choisis doivent être appropriés pour l’action à laquelle ils sont destinés.",
    "HierarchyDoImgAlt": "Une interface utilisateur utilisant plusieurs types de boutons. Il y a un bouton principal, un bouton secondaire et un bouton simple, pour créer une hiérarchie visuelle.",
    "HierarchyDontText": "L’utilisation de plusieurs boutons principaux dans une même page ou section.",
    "HierarchyDontImgAlt": "Une interface utilisateur utilisant plusieurs boutons principaux ne permet pas à l’utilisateur de savoir quelle action est la plus importante.",
    "DestructiveHeading": "Les actions destructrices",
    "DestructiveDoText": "L’utilisation du bouton critique ou du bouton simple critique pour les actions destructives.",
    "DestructiveDoImgAlt": "Une fenêtre modale avec deux options : annuler et supprimer. Le bouton de suppression est un bouton critique rouge.",
    "DestructiveDontText": "D’autres types de boutons doivent être utilisés pour les actions destructives.",
    "DestructiveDontImgAlt": "Une fenêtre modale avec deux options : annuler et supprimer. Le bouton de suppression est un bouton principal bleu foncé, ce qui est incorrect.",
    "PlainDoText": "Utiliser des boutons simples pour permettre à l’utilisateur d’effectuer une action ou de naviguer dans l’application.",
    "PlainDoImgAlt": "Une interface utilisateur de type formulaire avec des boutons simples utilisés pour naviguer entre les étapes du formulaire.",
    "PlainDontText": "Utiliser des boutons simples pour lier l’utilisateur à d’autres pages ou sites Web. Dans ce cas, il faut utiliser les liens.",
    "PlainDontImgAlt": "Un centre d’aide déterminé comme une ressource avec un bouton simple utilisé pour renvoyer l’utilisateur vers le site Web du centre d’aide.",
    "SpacingGroupsHeading": "Espacement des groupes de boutons",
    "SpacingGroupsText": "Un groupe de boutons est un ensemble de boutons qui ont une relation contextuelle. Pour créer une cohérence dans la façon dont ces actions sont liées visuellement, des règles cohérentes d’espacement doivent être suivies. Pour les grands groupes de boutons, il doit y avoir un espacement de 16 pixels entre les boutons. Pour les petits groupes de boutons, il doit y avoir un espacement de 12 pixels entre les boutons.",
    "SpacingGroupsImgAlt": "Spécifications indiquant l’espacement acceptable entre les boutons. L’espacement est décrit dans le paragraphe ci-dessous.",
    "MinMaxWidthHeading": "Largeurs minimales et maximales",
    "MinMaxWidthImgAlt": "Spécifications affichant les largeurs minimales et maximales des composantes des boutons. Ces largeurs sont décrites dans la section suivante:",
    "MinMaxWidthText": "Les boutons de grande taille ont une largeur maximale de 400 pixels et une largeur minimale de 64 pixels. Les petits boutons ont une largeur maximale de 400 pixels et une largeur minimale de 52 pixels.",
    "AnatomyHeading": "Anatomie",
    "AnatomyImgAlt": "Les parties qui constituent les composantes du bouton. Les parties sont décrites dans la section suivante:",
    "AnatomyBGHeading": "Fond",
    "AnatomyBGText": "Le remplissage du fond derrière l’étiquette et l’icône du bouton. Le rayon des boutons de petite et de grande taille est de 4 pixels.",
    "AnatomyIconText": "Les icônes sont utilisées pour soutenir le contenu de l’étiquette du bouton. Elles sont facultatives et elles peuvent être affichées ou masquées à l’aide des configurations d’icônes.",
    "AnatomyLblHeading": "Étiquette",
    "AnatomyLblText": "L’étiquette fournit à l’utilisateur le contexte relatif à l’action que le bouton va effectuer.",
    "SpecsHeading": "Spécifications",
    "SpecsImgAlt": "Spécifications affichant les mesures quant au remplissage et aux couches des composantes du bouton.",
    "SpecsText": "le remplissage vertical du petit bouton avec une disposition fluide est de 8 pixels et le remplissage horizontal à l’intérieur du bouton est de 16 pixels. L’icône a une largeur et une hauteur de 20 pixels. Il y a 8 pixels entre l’icône et l’étiquette. La largeur de l’étiquette est dynamique selon le nombre de caractères qu’elle contient. Le remplissage vertical du grand bouton avec une disposition fluide est de 12 pixels et le remplissage horizontal à l’intérieur du bouton est de 20 pixels. L’icône a une largeur et une hauteur de 24 pixels. Il y a 8 pixels entre l’icône et l’étiquette. La largeur de l’étiquette est dynamique selon le nombre de caractères qu’elle contient. Le remplissage vertical du petit bouton avec une disposition fixe et le remplissage horizontal fluide basé sur la largeur fixe du bouton sont de 8 pixels. L’icône a une largeur et une hauteur de 20 pixels. Il y a 8 pixels entre l’icône et l’étiquette. La largeur de l’étiquette est dynamique selon le nombre de caractères qu’elle contient. Le remplissage vertical grand bouton avec une disposition fixe et le remplissage horizontal fluide basé sur la largeur fixe du bouton sont de 12 pixels. L’icône a une largeur et une hauteur de 24 pixels. Il y a 8 pixels entre l’icône et l’étiquette. La largeur de l’étiquette est dynamique selon le nombre de caractères qu’elle contient.",
    "ContentGuidelinesHeading": "Directives sur le contenu",
    "CaseHeading": "Utilisation de la majuscule sur les étiquettes",
    "CaseDoImgAlt": "Utilisation de minuscules sur un bouton indiquant « Enregistrer les modifications ».",
    "CaseDoText": "Utiliser des minuscules pour les étiquettes de boutons",
    "CaseDontImgAlt": "Utilisation de la majuscule pour la première lettre du bouton indiquant « Enregistrer les modifications ».",
    "CaseDontText": "Utiliser des majuscules pour la première lettre sur les étiquettes de boutons",
    "DescriptiveHeading": "Étiquettes axées sur les tâches",
    "DescriptiveDoImgAlt": "Un bouton dont l’étiquette indique « Afficher mes documents ».",
    "DescriptiveDoText": "Rédiger des descriptions d’étiquettes de bouton correspondant à l’action que le bouton va effectuer.",
    "DescriptiveDontText": "Rédiger des descriptions d’étiquettes de bouton qui sont statiques et qui ne décrivent pas une action.",
    "DescriptiveDontImgAlt": "Un bouton dont l’étiquette indique « Documents ».",
    "FigmaHeading": "Utilisation dans Figma",
    "FigmaDirectionsHeading": "Mode d’emploi",
    "FigmaDirectionsListItem1": "Dans le panneau des ressources, faire glisser le composant « bouton » à partir de la bibliothèque des composants.",
    "FigmaDirectionsListItem2": "Dans le panneau de droite, configurer les propriétés et les variantes en fonction de vos besoins.",
    "FigmaDirectionsListItem3": "Ne jamais modifier les couleurs, le rayon, le remplissage, la taille du texte, etc. De cette façon, les éléments fondamentaux restent cohérents.",
    "FigmaDirectionsListItem4": "Si une icône est utilisée, les concepteurs peuvent <a target=_blank href=https://www.loom.com/share/b0d137f991034f08b504c93278384c2f>modifier</a> le mot-clé de Font Awesome afin de mettre à jour l’icône du bouton pour n’importe quelle icône de Font Awesome.",
    "FigmaDirectionsImgAlt": "Une capture d’écran du panneau de conception de Figma. Le panneau de conception affiche les options de configuration parmi lesquelles les concepteurs peuvent choisir lorsqu’ils personnalisent un bouton.",
    "AccessibilityHeading": "Accessibilité",
    "AccessibilityColourHeading": "Contraste des couleurs",
    "AccessibilityColourText": "Les boutons principaux ont un rapport de contraste des couleurs de 8,88 : 1 et répondent aux normes d’accessibilité AAA selon la version 2.1 des normes WCAG.",
    "AccessibilityKeyboardHeading": "Clavier accessible",
    "AccessibilityKeyboardText": "Les boutons sont élaborés à l’aide de l’élément bouton HTML original afin de garantir que les éléments interactifs sont accessibles sur le clavier et conformes aux normes AA de la version 2.1 des normes WCAG.",
    "ResearchHeading": "Recherche",
    "ResearchText": "À venir."
  },
  "Utilities": {
    "title": {
      "tokens": "[FR] Tokens"
    },
    "sub-titles": {
      "pixels": "pixels"
    },
    "content": {
      "figma-usage": "Utiliser {{px}} pixels d’espacement",
      "bp-figma-usage": "Définir la largeur du cadre à {{px}} pixels"
    },
    "Heading": "Utilitaires",
    "Text": "Les jetons sont des utilitaires réutilisables qui sont appliqués de manière cohérente aux éléments et aux composants dans l’ensemble du système de conception. Cela crée une cohérence dans la façon dont les couleurs, l’espacement, etc. sont appliqués et cela permet d’effectuer des répétitions des conceptions à l’échelle mondiale qui sont efficaces et fiables.",
    "TypographyHeading": "Typographie",
    "TypographyText": "L’échelle de caractères réduit le nombre de styles au minimum et elle est conçue pour assurer une hiérarchie visuelle efficace du contenu dans son ensemble. Les styles de texte comprennent des tailles de points, des hauteurs de lignes et des espacements de paragraphes qui répondent aux normes d’accessibilité AAA de la version 2.1 des normes WCAG.",
    "SpacingHeading": "Espacement",
    "SpacingText": "Unités d’espacement à appliquer comme remplissage ou comme marges dans l’interface utilisateur. Les options d’espacement sont limitées pour aider à créer une cohérence entre les espacements. Toutes les unités d’espacement sont en groupe de quatre pour respecter une grille de quatre pixels.",
    "SpacingTableSampleHeading": "Échantillon",
    "SpacingTableVariableHeading": "Nom de la variable",
    "SpacingTableValueHeading": "Valeur",
    "SpacingTableFigmaHeading": "Utilisation de Figma",
    "BreakpointsHeading": "Points d’arrêt",
    "BreakpointsText": "Définir des points d’arrêt permet au contenu et à la conception de s’adapter afin de fournir la meilleure disposition possible pour la fenêtre d’affichage ou le périphérique. Utiliser les largeurs fréquentes des points d’arrêt pour assurer la cohérence de la mise en page. Les consommateurs du système de conception peuvent ajouter des points d’arrêt supplémentaires si nécessaire.",
    "BreakpointsTableWidthHeading": "Largeur",
    "ColourHeading": "Couleurs",
    "ColourText": "Les concepteurs ont le choix entre plusieurs couleurs pour assurer une communication claire, indiquer la fonctionnalité de l’interface utilisateur et fournir un contraste de couleurs conforme aux normes d’accessibilité. Le système de couleurs est conçu pour définir la signification de chaque couleur, permettre des changements de couleur globaux et garantir que chaque couleur utilisée provient du système.",
    "ColourTableTokenHeading": "Nom du jeton",
    "ColourTableColourHeading": "Rôle de la couleur, teinte et valeur hexadécimale",
    "ColourTableFigmaHeading": "Style de couleur Figma",
    "ColourTableDescriptionHeading": "[FR] Description",
    "ColourTableDescriptionRow1": "[FR] Background of the primary button.",
    "ColourTableDescriptionRow2": "[FR] Background of the primary button while in the hover state.",
    "ColourTableDescriptionRow3": "[FR] Background of the primary button while in the active state.",
    "ColourTableDescriptionRow4": "[FR] Background of the primary button while in the disabled state.",
    "ColourTableDescriptionRow5": "[FR] Text and icon within the primary button.",
    "ColourTableDescriptionRow6": "[FR] Text and icon within the disabled state of the primary button.",
    "ColourTableDescriptionRow7": "[FR] Background of the primary button using the Critical colour role.",
    "ColourTableDescriptionRow8": "[FR] Background of the primary button using the Critical colour role while in the hover state.",
    "ColourTableDescriptionRow9": "[FR] Background of the primary button using the Critical colour role while in the active state.",
    "ColourTableDescriptionRow10": "[FR] Background of the primary button using the Critical colour role while in the disabled state.",
    "ColourTableDescriptionRow11": "[FR] Text and icon within the primary button using the Critical colour role.",
    "ColourTableDescriptionRow12": "[FR] Text and icon within the disabled state of the primary button using the Critical colour role.",
    "ColourTableDescriptionRow13": "[FR] Border of the secondary button.",
    "ColourTableDescriptionRow14": "[FR] Border of the secondary button while in the hover state.",
    "ColourTableDescriptionRow15": "[FR] Border of the secondary button while in the active state.",
    "ColourTableDescriptionRow16": "[FR] Border of the secondary button while in the disabled state.",
    "ColourTableDescriptionRow17": "[FR] Text and icon within the secondary button.",
    "ColourTableDescriptionRow18": "[FR] Text and icon within the disabled state of the secondary button.",
    "ColourTableDescriptionRow19": "[FR] Border of the secondary button using the Critical colour role.",
    "ColourTableDescriptionRow20": "[FR] Border of the secondary button using the Critical colour role while in the hover state.",
    "ColourTableDescriptionRow21": "[FR] Border of the secondary button using the Critical colour role while in the active state.",
    "ColourTableDescriptionRow22": "[FR] Border of the secondary button using the Critical colour role while in the disabled state.",
    "ColourTableDescriptionRow23": "[FR] Text and icon within the secondary button using the Critical colour role.",
    "ColourTableDescriptionRow24": "[FR] Text and icon within the disabled state of the secondary button using the Critical colour role.",
    "ColourTableDescriptionRow25": "[FR] Text colour of links in the default state.",
    "ColourTableDescriptionRow26": "[FR] Text colour of links in the hover state.",
    "ColourTableDescriptionRow27": "[FR] Text colour of links in the active state.",
    "ColourTableDescriptionRow28": "[FR] Text colour of links after they have been visited.",
    "ColourTableDescriptionRow29": "[FR] Background of alert banners with the warning sentiment.",
    "ColourTableDescriptionRow30": "[FR] Border of alert banners with the warning sentiment.",
    "ColourTableDescriptionRow31": "[FR] Icon in alert banners with the warning sentiment.",
    "ColourTableDescriptionRow32": "[FR] Background of alert banners with the critical sentiment.",
    "ColourTableDescriptionRow33": "[FR] Border of alert banners with the critical sentiment.",
    "ColourTableDescriptionRow34": "[FR] Icon in alert banners with the critical sentiment.",
    "ColourTableDescriptionRow35": "[FR] Background of alert banners with the success sentiment.",
    "ColourTableDescriptionRow36": "[FR] Border of alert banners with the success sentiment.",
    "ColourTableDescriptionRow37": "[FR] Icon in alert banners with the success sentiment.",
    "ColourTableDescriptionRow38": "[FR] Background of alert banners with the information sentiment.",
    "ColourTableDescriptionRow39": "[FR] Border of alert banners with the information sentiment.",
    "ColourTableDescriptionRow40": "[FR] Icon in alert banners with the information sentiment.",
    "ColourTableDescriptionRow41": "[FR] Background of selected form elements while displaying an error.",
    "ColourTableDescriptionRow42": "[FR] Background of selected form elements while displaying an error and in the hover state.",
    "ColourTableDescriptionRow43": "[FR] Background of selected form elements while displaying an error and in the active state.",
    "ColourTableDescriptionRow44": "[FR] Background of selected form elements while displaying an error and in the disabled state.",
    "ColourTableDescriptionRow45": "[FR] Background of unselected form elements while displaying an error.",
    "ColourTableDescriptionRow46": "[FR] Background of unselected form elements while displaying an error and in the hover state.",
    "ColourTableDescriptionRow47": "[FR] Background of unselected form elements while displaying an error and in the active state.",
    "ColourTableDescriptionRow48": "[FR] Background of unselected form elements while displaying an error and in the disabled state.",
    "ColourTableDescriptionRow49": "[FR] Border of unselected form elements while displaying an error.",
    "ColourTableDescriptionRow50": "[FR] Border of unselected form elements while displaying an error and in a hover state.",
    "ColourTableDescriptionRow51": "[FR] Border of unselected form elements while displaying an error and in a disabled state.",
    "ColourTableDescriptionRow52": "[FR] Text used for error messages.",
    "ColourTableDescriptionRow53": "[FR] Background of selected form elements while displaying success.",
    "ColourTableDescriptionRow54": "[FR] Background of selected form elements while displaying success and in the hover state.",
    "ColourTableDescriptionRow55": "[FR] Background of selected form elements while displaying success and in the active state.",
    "ColourTableDescriptionRow56": "[FR] Background of selected form elements while displaying success and in the disabled state.",
    "ColourTableDescriptionRow57": "[FR] Background of unselected form elements while displaying success.",
    "ColourTableDescriptionRow58": "[FR] Background of unselected form elements while displaying success and in the hover state.",
    "ColourTableDescriptionRow59": "[FR] Background of unselected form elements while displaying success and in the active state.",
    "ColourTableDescriptionRow60": "[FR] Background of unselected form elements while displaying success and in the disabled state.",
    "ColourTableDescriptionRow61": "[FR] Border of unselected form elements while displaying success.",
    "ColourTableDescriptionRow62": "[FR] Border of unselected form elements while displaying success and in a hover state.",
    "ColourTableDescriptionRow63": "[FR] Border of unselected form elements while displaying success and in a disabled state.",
    "ColourTableDescriptionRow64": "[FR] Text used for success messages.",
    "ColourTableDescriptionRow65": "[FR] Background of selected form elements while displaying warning.",
    "ColourTableDescriptionRow66": "[FR] Background of selected form elements while displaying warning and in the hover state.",
    "ColourTableDescriptionRow67": "[FR] Background of selected form elements while displaying warning and in the active state.",
    "ColourTableDescriptionRow68": "[FR] Background of selected form elements while displaying warning and in the disabled state.",
    "ColourTableDescriptionRow69": "[FR] Background of unselected form elements while displaying warning.",
    "ColourTableDescriptionRow70": "[FR] Background of unselected form elements while displaying warning and in the hover state.",
    "ColourTableDescriptionRow71": "[FR] Background of unselected form elements while displaying warning and in the active state.",
    "ColourTableDescriptionRow72": "[FR] Background of unselected form elements while displaying warning and in the disabled state.",
    "ColourTableDescriptionRow73": "[FR] Border of unselected form elements while displaying warning.",
    "ColourTableDescriptionRow74": "[FR] Border of unselected form elements while displaying warning and in a hover state.",
    "ColourTableDescriptionRow75": "[FR] Border of unselected form elements while displaying warning and in a disabled state.",
    "ColourTableDescriptionRow76": "[FR] Text used for warning messages.",
    "ColourTableDescriptionRow77": "[FR] Background of selected form elements while displaying information.",
    "ColourTableDescriptionRow78": "[FR] Background of selected form elements while displaying information and in the hover state.",
    "ColourTableDescriptionRow79": "[FR] Background of selected form elements while displaying information and in the active state.",
    "ColourTableDescriptionRow80": "[FR] Background of selected form elements while displaying information and in the disabled state.",
    "ColourTableDescriptionRow81": "[FR] Background of unselected form elements while displaying information.",
    "ColourTableDescriptionRow82": "[FR] Background of unselected form elements while displaying information and in the hover state.",
    "ColourTableDescriptionRow83": "[FR] Background of unselected form elements while displaying information and in the active state.",
    "ColourTableDescriptionRow84": "[FR] Background of unselected form elements while displaying information and in the disabled state.",
    "ColourTableDescriptionRow85": "[FR] Border of unselected form elements while displaying information.",
    "ColourTableDescriptionRow86": "[FR] Border of unselected form elements while displaying information and in a hover state.",
    "ColourTableDescriptionRow87": "[FR] Border of unselected form elements while displaying information and in a disabled state.",
    "ColourTableDescriptionRow88": "[FR] Text used for information messages.",
    "ColourTableDescriptionRow89": "[FR] Main background of the page.",
    "ColourTableDescriptionRow90": "[FR] Can be used for side panels, mastheads, footers if using a different colour than the main bg is desired.",
    "ColourTableDescriptionRow91": "[FR] Used for surfaces that temporarily overlay on the main product – flyout menus, modal windows, dropdown menus, etc.",
    "ColourTableDescriptionRow92": "[FR] Background fill on interactive elements that have no fill when in the hover state.",
    "ColourTableDescriptionRow93": "[FR] Background fill on interactive elements that have no fill when in the active state.",
    "ColourTableDescriptionRow94": "[FR] Generic, accessible border outline. Can be used to outline input fields, tables, etc.",
    "ColourTableDescriptionRow95": "[FR] Generic, accessible border outline in the hover state. Can be used to outline input fields, etc.",
    "ColourTableDescriptionRow96": "[FR] Generic, accessible border outline in the disabled state. Can be used to outline input fields, etc.",
    "ColourTableDescriptionRow97": "[FR] Used for divider lines to separate content, page architecture, table cells, etc.",
    "ColourTableDescriptionRow98": "[FR] Transparent background used to create separation between a screen and a popup or modal window.",
    "ColourTableDescriptionRow99": "[FR] Used for selected indicators on navigation items.",
    "ColourTableDescriptionRow100": "[FR] Used for selected indicators on navigation items that are in a hover state.",
    "ColourTableDescriptionRow101": "[FR] Used for selected backgrounds on navigation items.",
    "ColourTableDescriptionRow102": "[FR] Used for selected backgrounds on navigation items that are in a hover state.",
    "ColourTableDescriptionRow103": "[FR] Used to indicate selected form controls.",
    "ColourTableDescriptionRow104": "[FR] Used to indicate selected form controls that are in a hover state.",
    "ColourTableDescriptionRow105": "[FR] Used for selected indicators on navigation items that are in a disabled state.",
    "ColourTableDescriptionRow106": "[FR] Used to indicate selected form controls that are in a disabled state.",
    "ColourTableDescriptionRow107": "[FR] Text and selected indicators on top of components that are in a selected state. For example, the checkmark icon within of a selected checkbox.",
    "ColourTableDescriptionRow108": "[FR] All text that requires a primary visual hierarchy.",
    "ColourTableDescriptionRow109": "[FR] All text that requires a secondary visual hierarchy. Can also be used as supporting text alongside primary text if there is a contextual relationship between the two.",
    "ColourTableDescriptionRow110": "[FR] Placeholder text within input field components.",
    "ColourTableDescriptionRow111": "[FR] Disabled text within interactive elements that use a neutral text palette.",
    "ColourTableDescriptionRow112": "[FR] The outline used to indicate that an element is in focus.",
    "TypographyTableStyleHeading": "Style",
    "TypographyTableFontWeightHeading": "Police et dimensions",
    "TypographyTableSizeHeading": "Format",
    "TypographyTableLineHeightHeading": "Hauteur de ligne et espacement des paragraphes",
    "TypographyTableFigmaHeading": "Style de texte Figma",
    "TypographyTableTokenHeading": "Nom du cours"
  },
  "RightSideNav": {
    "OnThisPage": "[FR] On this Page"
  },
  "LeftSideNav": {
    "title": {
      "getting-started" : "[FR] Getting Started",
      "foundation" : "[FR] Foundation",
      "components" : "[FR] Components",
      "support": "[FR] Support"
    },
    "sub-titles": {
      "overview": "[FR] Overview",
      "for-developers": "[FR] For developers",
      "for-designers": "[FR] For designers",
      "accessibility": "[FR] Accessibility",
      "colours": "Couleurs",
      "typography": "Typographie",
      "iconography": "[FR] Iconography",
      "layouts": "[FR] Layouts",
      "tokens": "[FR] Tokens",
      "buttons": "Boutons",
      "checkbox": "[FR] Checkbox",
      "external-link": "[FR] External Link",
      "footer": "[FR] Footer",
      "header": "[FR] Header",
      "icon-button": "[FR] Icon button",
      "input-field": "[FR] Input field",
      "radio-button": "[FR] Radio button",
      "tabs": "[FR] Tabs",
      "contact": "[FR] Contact"
    }
  },
  "OverviewPage": {
    "title": "[FR] Overview",
    "sub-title": "[FR] IRCC design system",
    "sub-title-description": "[FR] The IRCC design system is a toolkit of shared design and code that provides visual language, components, patterns and guidelines – all in one centralized source of truth that enables product teams to build scalable, accessible, unified experiences. It is customized for the client and officer experience and allows teams to efficiently build consistent immigration digital services.",
    "sub-heading-1": "[FR] For designers",
    "sub-heading-1-description": "[FR] Learn how to get started with the IRCC design system Figma library.",
    "sub-heading-2": "[FR] For developers",
    "sub-heading-2-description": "[FR] Learn how to get started with lorem ipsum dolor sir amet consecteteur.",
    "get-started-sub-text": "[FR] Get started"
  },
  "Designers": {
    "Heading": "[FR] For designers",
    "HeadingText": "[FR] If you’re a designer, start here to find everything you need to use the design system’s Figma library.",
    "AboutHeading": "[FR] About the design library",
    "AboutText1": "[FR] The design system consists, in part, of a Figma library. This is the primary tool for designers to use and it allows them to create system-compatible designs. The design library is a centralized set of Figma files that is maintained by a core design system team. By connecting your project to the design library, your projects will automatically inherit updates, improvements and new features published to the design library.",
    "AboutText2": "[FR] Figma is a collaborative design platform that is built to handle UI/UX and design system use cases. <a href='https://www.figma.com'>Learn more about Figma</a> or browse <a href='https://www.youtube.com/@Figma'>Figma’s Youtube channel</a> to become more familiar with the software or watch tutorials.",
    "AccessHeading": "[FR] Requesting access to the design library",
    "AccessText1": "[FR] The design library is published as a team library on Figma. There are currently three Figma files to connect to your project in order to access the full design system – Foundations, Components and Patterns. Here are the steps to get access:",
    "AccessListItem1": "[FR] <a href='https://www.figma.com/signup'>Create a Figma account</a> if you don’t have one already.",
    "AccessListItem2": "[FR] Email Matthew.Emond@cic.gc.ca and tell us the email you use for your Figma account. You will receive a response as soon as we’ve granted you access.",
    "AccessListItem3": "[FR] Once you have received confirmation that you have access, log into Figma with the email you provided.",
    "AccessListItem4": "[FR] Create a new design file or open an existing project.",
    "AccessListItem5": "[FR] On the left sidebar, select “Assets,” then select the Team Library icon.",
    "AccessListItem6": "[FR] Enable the team library by selecting the toggle next to the <strong>“Foundations”</strong>, <strong>“Components”</strong> and <strong>“Patterns”</strong> libraries.",
    "AccessText2": "[FR] You should now have access to the colours & text styles, components, and user patterns.",
    "AccessText3": "[FR] Once you have enabled the team libraries, you will automatically receive any updates or additions to styles and components that are published in the future.",
    "FigmaImg1AltText": "[FR] The Figma interface used for connecting external component libraries to a Figma file.",
    "InstallFontsHeading": "[FR] Installing the design system fonts",
    "InstallFontsText1": "[FR] The design system uses Lato, Inter and Font Awesome (icon font). Lato and Inter are Google fonts and should automatically be available within Figma in the font picker. Font Awesome has been set as a “shared font” for our organization plan and should also be available automatically within Figma in the font picker. If you are not a member of the “IRCC - Journey Labs” Figma organization, you will need to obtain and install a paid version of Font Awesome or use your own icon font in combination with this design system.",
    "InstallFontsLink": "[FR] <a href=https://fontawesome.com/'>Learn more about Font Awesome </a>",
    "InstallFontsLinkURL": "[FR] https://fontawesome.com/",
    "UsingStylesHeading": "[FR] Using design system styles",
    "UsingStylesText1": "[FR] Once you’ve connected to the Figma libraries, and ensured you have access to the correct fonts within Figma, you’re ready to start using the colour and text styles from the system.",
    "UsingStylesStrokeText1": "[FR] To apply a fill or stroke colour:",
    "UsingStylesStrokeListItem1": "[FR] Make sure you’ve connected the <strong>“Foundations”</strong> library to your Figma file",
    "UsingStylesStrokeListItem2": "[FR] Select the layer you want to apply the colour style to",
    "UsingStylesStrokeListItem3": "[FR] In the design panel, click on the style icon (four dots) and find the system colour style you want to apply under the “fill” and/or “stroke” properties",
    "UsingStylesStrokeListItem4": "[FR] Pro tip: Use the search field to filter the colour style list",
    "UsingStylesStrokeText2": "[FR] See the <a href='#'>list of all colour tokens</a> and how they apply. We will be adding a colours page to this documentation site for additional details and guidance.",
    "UsingStylesStrokeImgAltText": "[FR] The Figma interface used for applying colour styles to a layer.",
    "UsingStylesTextText1": "[FR] To apply a text style:",
    "UsingStylesTextListItem1": "[FR] Make sure you’ve connected the <strong>“Foundations”</strong> library to your Figma file",
    "UsingStylesTextListItem2": "[FR] Select the text layer you want to the text style to",
    "UsingStylesTextListItem3": "[FR] In the design panel, click on the style icon (four dots) and find the system text style you want to apply under the “text” property",
    "UsingStylesTextListItem4": "[FR] Pro tip: Use the search field to filter the text style list",
    "UsingStylesTextText2": "[FR] See the <a href='#'>list of all text tokens</a> and how they apply. We will be adding a typography page to this documentation site for additional details and guidance.",
    "UsingStylesTextImgAltText": "[FR] The Figma interface used for applying text styles to a text layer.",
    "UsingComponentsHeading": "[FR] Using design system components",
    "UsingComponentsText1": "[FR] Once you’ve connected to the Figma libraries, and ensured you have access to the correct fonts within Figma, you’re ready to start using the components from the system.",
    "UsingComponentsInsertText1": "[FR] To insert a system component into your design file:",
    "UsingComponentsInsertListItem1": "[FR] Make sure you’ve connected the <strong>“Components”</strong> and <strong>“Patterns”</strong> libraries to your Figma file",
    "UsingComponentsInsertListItem2": "[FR] In the left side panel, click on the “Assets” tab",
    "UsingComponentsInsertListItem3": "[FR] Find the component you would like to insert into your design by either searching or browsing the component list",
    "UsingComponentsInsertListItem4": "[FR] Drag and drop the component from the side panel into your design",
    "UsingComponentsInsertListItem5": "[FR] Pro tip: Use the search field to filter the component list",
    "UsingComponentsInsertImgAlt": "[FR] The Figma assets panel used for viewing external and local components.",
    "UsingComponentsConfigureText1": "[FR] Most components have configurable options. To configure the component you inserted:",
    "UsingComponentsConfigureListItem1": "[FR] Select the component you would like to configure",
    "UsingComponentsConfigureListItem2": "[FR] Find the available options in the design panel",
    "UsingComponentsConfigureListItem3": "[FR] Use the dropdown menus and toggles to select the desired configuration",
    "UsingComponentsConfigureImgAlt": "[FR] The Figma design panel displaying configuration options for a button component.",
    "FigmaHeading": "[FR] Figma usage guidelines",
    "FigmaText": "[FR] The above is general information in order to get started. You can find more detailed Figma usage guidelines specific to each system part on on their respective pages throughout this site."
  },
  "ForDevelopers": {
    "title": "[FR] For developers",
    "GettingStarted": "[FR] Getting started",
    "Usage": "[FR] Usage",
    "Notes": "[FR] Notes"
  }
}



